app/views/home/historicos.html.erb

SELECT "servicio_pvs".* FROM "servicio_pvs" WHERE (idpvs = 3)
---

        <%@servicio = ServicioPv.where("idpvs = " + compras.servicio.to_s )%>