app/views/home/index.html.erb


        <%@existe =  UsuarioServicio.where("msisdn = ? AND servicio = ?",@msisdn,serpvs.id).count%>
---
SELECT COUNT(*) FROM "usuario_servicios" WHERE (msisdn = '571234567890' AND servicio = 1)