app/views/home/mis_compras.html.erb


        <%@servicio = ServicioPv.where("idpvs = " + compras.servicio.to_s )%>
---
SELECT "servicio_pvs".* FROM "servicio_pvs" WHERE (idpvs = 2)