app/controllers/home_controller.rb

SELECT "servicio_pvs".* FROM "servicio_pvs"
---
  def index
      @ServiciosPvs = ServicioPv.all()

SELECT "historicos".* FROM "historicos" WHERE (msisdn = '571234567890')
---
  def historicos
    @Historicos = Historico.where("msisdn = ?",session[:msisdn])

SELECT "usuario_servicios".* FROM "usuario_servicios" WHERE (msisdn = 571234567890)
---
  def mis_compras
    @MisCompras = UsuarioServicio.where("msisdn = ?",session[:msisdn])