app/controllers/operacion_controller.rb

    def create
        @suscripcion = UsuarioServicio.new
        @suscripcion.msisdn = params[:msisdn]
        @suscripcion.servicio = params[:servicio]
        @suscripcion.save
---
INSERT INTO "usuario_servicios" ("msisdn", "servicio", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["msisdn", 571234567890], ["servicio", 3], ["created_at", "2018-12-14 04:47:34.030627"], ["updated_at", "2018-12-14 04:47:34.030627"]]

    def delete

        msisdn = params[:msisdn]
        servicio = params[:servicio]

        @suscripcion = UsuarioServicio.where("msisdn = ?  AND servicio = ?", msisdn, servicio)
        @suscripcion[0].destroy

        @desuscripcion = Historico.new
        @desuscripcion.msisdn = params[:msisdn]
        @desuscripcion.servicio = params[:servicio]
        @desuscripcion.save
---
SELECT "usuario_servicios".* FROM "usuario_servicios" WHERE (msisdn = '571234567890'  AND servicio = '3')
DELETE FROM "usuario_servicios" WHERE "usuario_servicios"."id" = ?  [["id", 7]]
INSERT INTO "historicos" ("msisdn", "servicio", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["msisdn", 571234567890], ["servicio", 2], ["created_at", "2018-12-14 04:50:54.537962"], ["updated_at", "2018-12-14 04:50:54.537962"]]